## Plan Result (feature-flags-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/246727)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 2 to destroy.</code></pre>

* Delete
  * aws_cloudwatch_log_group.application_ecs_service_ecs-xray-daemon_963C2C1F
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.application_ecs_service_ecs-xray-daemon_963C2C1F will be destroyed
  # (because aws_cloudwatch_log_group.application_ecs_service_ecs-xray-daemon_963C2C1F is not in configuration)
  - resource "aws_cloudwatch_log_group" "application_ecs_service_ecs-xray-daemon_963C2C1F" {
      - arn               = "arn:aws:logs:us-east-1:996905175585:log-group:/ecs/FeatureFlags-Prod/xray-daemon20231129182155361100000003" -> null
      - id                = "/ecs/FeatureFlags-Prod/xray-daemon20231129182155361100000003" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/FeatureFlags-Prod/xray-daemon20231129182155361100000003" -> null
      - name_prefix       = "/ecs/FeatureFlags-Prod/xray-daemon" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "app_code"       = "pocket"
          - "component_code" = "pocket-featureflags"
          - "costCenter"     = "Pocket"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "FeatureFlags"
        } -> null
      - tags_all          = {
          - "app_code"       = "pocket"
          - "component_code" = "pocket-featureflags"
          - "costCenter"     = "Pocket"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "FeatureFlags"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/FeatureFlags-Prod:422" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/FeatureFlags-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
                {
                    cpu                    = 0
                    environment            = [
                        {
                            name  = "NODE_ENV"
                            value = "production"
                        },
                    ]
                    essential              = true
                    healthCheck            = {
                        command     = [
                            "CMD-SHELL",
                            "curl -f http://localhost:4242/.well-known/apollo/server-health || exit 1",
                        ]
                        interval    = 15
                        retries     = 3
                        startPeriod = 0
                        timeout     = 5
                    }
                    image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/featureflags-prod-app:latest"
                    logConfiguration       = {
                        logDriver     = "awslogs"
                        options       = {
                            awslogs-group         = "/ecs/FeatureFlags-Prod/app20231129182155361800000004"
                            awslogs-region        = "us-east-1"
                            awslogs-stream-prefix = "ecs"
                        }
                        secretOptions = []
                    }
                    mountPoints            = []
                    name                   = "app"
                    portMappings           = [
                        {
                            containerPort = 4242
                            hostPort      = 4242
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    secrets                = [
                        {
                            name      = "AUTH_URL"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags/Prod/OAuthCredentials:authorizationURL::"
                        },
                        {
                            name      = "CALLBACK_URL"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags/Prod/OAuthCredentials:callbackURL::"
                        },
                        {
                            name      = "CLIENT_ID"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags/Prod/OAuthCredentials:clientId::"
                        },
                        {
                            name      = "CLIENT_SECRET"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags/Prod/OAuthCredentials:clientSecret::"
                        },
                        {
                            name      = "DB_HOST"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod/featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p-vdtnpc:host::"
                        },
                        {
                            name      = "DB_NAME"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod/featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p-vdtnpc:dbname::"
                        },
                        {
                            name      = "DB_PASSWORD"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod/featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p-vdtnpc:password::"
                        },
                        {
                            name      = "DB_PORT"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod/featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p-vdtnpc:port::"
                        },
                        {
                            name      = "DB_USERNAME"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags-Prod/featureflags-prod-auroradb-1tbz240e1m-auroradbapp-lva51ecuta8p-vdtnpc:username::"
                        },
                        {
                            name      = "ISSUER_URL"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags/Prod/OAuthCredentials:issuer::"
                        },
                        {
                            name      = "SENTRY_DSN"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/FeatureFlags/Prod/SENTRY_DSN"
                        },
                        {
                            name      = "TOKEN_URL"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags/Prod/OAuthCredentials:tokenURL::"
                        },
                        {
                            name      = "USER_INFO_URL"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:FeatureFlags/Prod/OAuthCredentials:userInfoURL::"
                        },
                    ]
                    systemControls         = []
                    volumesFrom            = []
                },
              - {
                  - command                = [
                      - "--region",
                      - "us-east-1",
                      - "--local-mode",
                    ]
                  - cpu                    = 0
                  - environment            = []
                  - essential              = true
                  - image                  = "amazon/aws-xray-daemon"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group         = "/ecs/FeatureFlags-Prod/xray-daemon20231129182155361100000003"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "xray-daemon"
                  - portMappings           = [
                      - {
                          - containerPort = 2000
                          - hostPort      = 2000
                          - protocol      = "udp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - repositoryCredentials  = {
                      - credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                  - systemControls         = []
                  - volumesFrom            = []
                },
            ] # forces replacement
        )
      ~ id                       = "FeatureFlags-Prod" -> (known after apply)
      ~ revision                 = 422 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket"
            "component_code" = "pocket-featureflags"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "FeatureFlags"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/FeatureFlags-Prod:422" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"c6338ca3-fff1-40c8-8f74-88b5a18b04f9","JobName":"feature-flags_infrastructure_plan_prod","PRNumber":675,"Program":"tfcmt","SHA1":"43abfa663c90642dd0745cde44ee02d4f29fd3f4","Target":"feature-flags-cdk","Vars":{}} -->